propertyDesc = {
  ISTJ:`<h2>세상의 소금형</h2>
  <h4>"한번 시작한 일은 끝까지 해내는 사람들"</h4>
  신중하고 조용하며 집중력이 강하고 매사에 철저하며 사리분별력이 뛰어나다. 실제 사실에 대하여 정확하고 체계적으로 기억하며 일 처리에 있어서도 신중하며 책임감이 강하다. 집중력이 강한 현실감각을 지녔으며 조직적이고 침착하다. 보수적인 경향이 있으며, 문제를 해결하는데 과거의 경험을 잘 적용하며, 반복되는 일상적인 일에 대한 인내력이 강하다. 자신과 타인의 감정과 기분을 배려하며, 전체적이고 타협적 방안을 고려하는 노력이 때로 필요하다. 정확성과 조직력을 발휘하는 분야의 일을 선호한다. 즉 회계, 법률, 생산, 건축, 의료, 사무직, 관리직 등에서 능력을 발휘하며, 위기상황에서도 안정되어 있다.
  <h4>일반적인 특성</h4>
  <ul>
  <li>오래된 조직을 좋아한다.</li>
  <li>부하직원을 부모와 자녀관계같이 돌보려고 한다.</li>
  <li>선입견이 강하다.</li>
  <li>친숙하지 않은 장소에 나서기를 주저한다.</li>
  <li>지나고 난 다음에 따지는 편이다.</li>
  <li>주어진 업무나 책임을 끝까지 완수한다.</li>
  <li>우리나라에서는 장남 같다, 장녀같다 라는 소리를 잘 듣는다.</li>
  <li>변화에 적응이 더디다.</li>
  <li>원리 원칙적이다.</li>
  <li>교통체증을 미리 계산해서 약속시간을 지킨다.</li>
  <li>이유없이 돌아다니지 않는다.</li>
  <li>대인관계 폭이 자꾸 좁아지고 대신 할 일이 늘어 난다.</li>
  <li>실수 한 것을 참지 못하고 즉각 수정하기를 원한다.</li>
  <li>남들이 속을 모른다라고 말함.</li>
  <li>틀에 박힌 규칙적인 일을 좋아한다.</li>
  <li>휴일에도 집에서 주로 지낸다.</li>
  <li>평소에 많이 참다가 폭발하면 상당히 무섭다.</li>
  <li>논리적, 합리적이지 않으면 인정하지 않음 웃음이 적다.</li>
  <li>반대성향을 지닌 사람과 처음에는 원만히 지내나 결국 멀어짐.</li>
  <li>잘못했다는 건 인정하면서도 미안하다, 잘못했다는 말을 잘 못한다.</li>
  <li>정리정돈을 해 놓는 것이 우선이다.</li>
  <li>직설적인 표현을 많이 하는 편이다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>얼굴 표정이 변화가 없어서 사람들 처음 대할 때 힘들어 할 수 있기 때문에 먼저 말을 붙이고, 웃는 연습이 필요.</li>
  <li>평소에 꼭 필요한 말만하기 때문에 분위기를 썰렁하게 만들 수 있으므로 유머가 필요.</li>
  <li>공휴일에 집에 있기보다는 가족과 함께 나들이가 필요.</li>
  </ul>`,
  ISFJ:`<h2>임금 뒷편의 권력형</h2>
  <h4>"성실하고 온화하며 협조를 잘하는 사람들"</h4>
  조용하고 차분하며 친근하고 책임감이 있으며 헌신적이다. 책임감이 강하고 온정적이며 헌신적이고, 침착하며, 인내력이 강하다. 다른 사람의 사정을 고려하며 자신과 타인의 감정에 민감하며, 일 처리에 있어서 현실감각을 갖고 실제적이고 조직적으로 처리한다. 경험을 통해서 자신이 틀렸다고 인정할 때까지 어떠한 난관이 있어도 꾸준히 밀고 나가는 형이다.  때로 의존적이고 독창성이 요구되며 타인에게 자신을 충분히 명확하게 표현하는 것이 필요할 때가 있다. 타인의 관심과 관찰력이 필요한 분야, 즉 의료, 간호, 교직, 사무직, 사회사업에 적합하다. 이들이 일을 하고, 세상일에 대처할 때 그들의 행동은 분별력이 있다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>자기 의견을 끝가지 주장하지 못하고 다수 의견에 따르게 된다.</li>
  <li>여러 사람 앞에서 말하기 힘들어한다.</li>
  <li>끈기 있고 성실하며, 안정감이 있다.</li>
  <li>치밀성과 반복을 요하는 일을 끝까지 해나가는 인내력이 있다.</li>
  <li>보수적이며 새로운 변화를 좋아하지 않는다.</li>
  <li>조직에 안정감을 준다.</li>
  <li>자기주장이 강한데 비하여 표현이 적어 속병이 많다.(위장병, 심장병 등) 많은 것을 가슴에 묻어 둔다.</li>
  <li>남들은 좋으나 본인이 힘들다.</li>
  <li>남에게 의존하는 것을 좋아한다.</li>
  <li>현모양처 감이다.</li>
  <li>나와 타인의 감정에 민감하다.</li>
  <li>책을 목차서부터 일기 시작하여 끝까지 읽는다.</li>
  <li>집에 있는 것이 편하다.</li>
  <li>무슨 일을 할 때 먼저 주변 정리부터 한다.</li>
  <li>여럿이 모여 떠드는 것 보다는 1 : 1 대화가 좋다.</li>
  <li>모험을 하지 않고 아는 길로만 간다.</li>
  <li>남에게 상처 줄까봐 말조심한다.</li>
  <li>남에게 싫은 소리 잘 못하고 싫은 소리를 들으면 상처를 많이 받는다.</li>
  <li>여럿의 대화 시 침묵을 지킨다.</li>
  <li>여행 시 짐이 많다.</li>
  <li>어른들이 좋아하나 본인은 힘들다.</li>
  <li>맏며느리 감이다.</li>
  <li>가정적인 아빠다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>술,담배는 전혀 도움이 되지 않음.</li>
  <li>술 안 먹고 노래방가서 큰 소리로 노래 부르고 춤추는 것이 필요.</li>
  <li>에어로빅 같은 활발한 운동이 성격개조에 좋다.</li>
  </ul>`,
  INFJ:`<h2>예언자형</h2>
  <h4>"사람과 관련된 뛰어난 통찰력을 가지고 있는 사람들"</h4>
  인내심이 많고 통찰력과 직관력이 뛰어나며 양심이 바르고 화합을 추구한다.
  창의력과 통찰력이 뛰어나며, 강한 직관력으로 말없이 타인에게 영향력을 끼친다. 독창성과 내적 독립심이 강하며, 확고한 신념과 열정으로 자신의 영감을 구현시켜 나가는 정신적 지도자들이 많다. 직관력과 사람중심의 가치를 중시하는 분야 즉, 성직, 심리학, 심리치료와 상담, 예술과 문학분야이다. 테크니칼한 분야로는 순수과학, 연구 개발분야로써 새로운 시도에 대한 열성이 대단하다. 한 곳에 몰두하는 경향으로 목적달성에 필요한 주변적인 조건들을 경시하기 쉽고, 자기 안의 갈등이 많고 복잡하다. 이들은 풍부한 내적인 생활을 소유하고 있으며 내면의 반응을 좀처럼 남과 공유하기 어려워한다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>영감력이 뛰어나고 깊이 있는 통찰력이 있다.</li>
  <li>현실의 유행에 대단히 둔감하고 현실과 거리가 멀다.</li>
  <li>보이지 않는 정신세계를 추구한다.</li>
  <li>의미부여. 왜 사나? 등에 관심이 많다.</li>
  <li>초, 중, 고, 생들이 방황을 할 수가 있다.</li>
  <li>생각이 많아 현실적응이 어려울 수 있다.</li>
  <li>같은 나이에 비해서 조숙해 보인다.</li>
  <li>문제의 본질을 생각한다.</li>
  <li>비유와 은유를 잘한다.</li>
  <li>종교적인 신념이 강하다.</li>
  <li>남의 시선을 너무 의식해서 불안하다.</li>
  <li>사람과의 교제 시작이 어렵다.</li>
  <li>잡념 때문에 수면 지장을 가져온다.</li>
  <li>본인이 하는 말을 남들이 잘 알아듣지 못하는 경우가 있다.</li>
  <li>현실과 타협이 힘들다.</li>
  <li>싫은 내색을 못하며 마음의 상처도 잘 받는다.</li>
  <li>나서기보다는 협조자로 적극적으로 돕는다.</li>
  <li>자아와의 갈등이 많다.</li>
  <li>사람에 대한 통찰력을 지녔다.</li>
  <li>옳다고 확신이 생긴 신념은 끝까지 밀고 나간다.</li>
  <li>의미 없다고 느끼는 일에 " ?" 가 따른다.</li>
  <li>현실에서도 이상을 꿈꾼다.</li>
  <li>기도나 기 수련에 관심이 많다.</li>
  <li>조용히 책보는 것을 좋아 한다.</li>
  <li>늘 존재에 대해 생각해 보고 생 과 사 영적인 문제에 관심이 많다.</li>
  <li>언행이 고상한 것을 좋아한다.</li>
  </ul>
  <h4>개발해야할점</h4> 
  <ul>
  <li>현실감을 키울 필요가 있다.</li>
  <li>웃는 연습이 필요 (항상 심각해 보일 수 있다.)</li>
  <li>가슴에 묻어 두지 말고 풀어내는 것이 필요.</li>
  </ul>`,
  INTJ:`<h2>과학자형</h2>
  <h4>"전체적인 부분을 조합하여 비젼을 제시하는 사람들"</h4>
  사고가 독창적이며 창의력과 비판분석력이 뛰어나며 내적 신념이 강하다. 행동과 사고에 있어 독창적이며 강한 직관력을 지녔다. 자신이 가진 영감과 목적을 실현시키려는 의지와 결단력과 인내심을 가지고 있다. 자신과 타인의 능력을 중요시하며, 목적달성을 위하여 온 시간과 노력을 바쳐 일한다. 직관력과 통찰력이 활용되는 분야, 즉 과학, 엔지니어링, 발명, 정치, 철학 분야 등에서 능력을 발휘한다. 냉철한 분석력 때문에 일과 사람을 있는 그대로의 사실적인 면을 보고자하는 노력이 필요하며 타인의 감정을 고려하고 타인의 관점에 진지하게 귀기울이는 것이 바람직하다.
  <h4>일반적인 특성</h4>
  <ul>
  <li>아주 이론적이다.</li>
  <li>어려운 난관은 자극제가 되며, 창의성을 많이 요하는 도전에 응하는 것을 즐김.</li>
  <li>비효율적으로 시간을 끄는 것을 싫어한다.</li>
  <li>놀기 위해서 노는 기술을 배운다.</li>
  <li>겉은 강하나 속은 아주 여리다.</li>
  <li>주부인 경우 살림하기 힘들어한다.</li>
  <li>인간관계에서 인간적 측면 부족으로 자기의 능력을 인정받지 못하는 경우가 있음.</li>
  <li>통찰력과 분석력으로 고집이 대단하다.</li>
  <li>재능은 많으나 쉽게 적응하기 어려워 할 수 있다.</li>
  <li>학구열이 강하다. (공부하기 좋아한다. 순수학문) </li>
  <li>대인관계 에서 차갑다는 느낌을 줄 수 있다.</li>
  <li>하고자하는 의지가 강하다.</li>
  <li>잡담을 시간적 낭비로 본다.</li>
  <li>일하는 환경에서 사람을 쉽게 사귄다.</li>
  <li>노는 자리를 어색해 한다.</li>
  <li>주어진 일에 성실하며 노력하는 편이다.</li>
  <li>의미가 있는 일은 열성으로 한다.</li>
  <li>회식을 별로 좋아하지 않는다.</li>
  <li>앞에 나서는 것을 대단히 싫어한다.</li>
  <li>혼자서 공상하는 것을 즐긴다.</li>
  <li>사적인 얘기는 거의 하지 않는다.</li>
  <li>영화를 볼 때도 무언가 잘못된 장면이 없나 찾으면서 볼 때가 있다.</li>
  <li>학생이 옳다고 교수하고도 싸울 때가 있다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>의도적으로 가족 오락이나 게임시간을 갖는 것이 필요</li>
  <li>타인의 의견에 대해서도 경청하는 자세가 필요</li>
  <li>혼자 일하기보다는 의도적으로 팀을 통해서 함께 하는 것이 필요</li>
  </ul>`,
  ISTP:`<h2>백과사전형</h2>
  <h4>"논리적이고 뛰어난 상황 적응력을 가지고 있는사람들"</h4>
  조용하고 과묵하고 절제된 호기심으로 인생을 관찰하며 상황을 파악하는 민감성과 도구를 다루는 뛰어난 능력이 있다. 말이 없으며, 객관적으로 인생을 관찰하는 형이다. 필요 이상으로 자신을 발휘하지 않으며, 일과 관계되지 않는 이상 어떤 상황이나 인간 관계에 직접 뛰어들지 않는다. 가능한 에너지 소비를 하지 않으려 하며, 사람에 따라 사실적 자료를 정리, 조직하길 좋아하며 기계를 만지거나 인과 관계나 객관적 원리에 관심이 많다. 연장, 도구, 기계를 다루는데 뛰어나며 사실들을 조직화하는 재능이 많으므로 법률, 경제, 마케팅, 판매, 통계 분야에 능력을 발휘한다. 민첩하게 상황을 파악하는 능력이 있다. 느낌이나 감정, 타인에 대한 마음을 표현하기 어려워한다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>소비성 경향이 많다</li>
  <li>마음에 없는 얘기를 상대방 기분 때문에 하지 않는다</li>
  <li>일반적으로 조용한 편이나 필요에 따라 사교적이다</li>
  <li>손재주가 뛰어 나다</li>
  <li>개인주의적 성향이 강하다</li>
  <li>충동에 따라 행동하기 때문에 언제라도 일자리를 박차고 떠날 수 있다</li>
  <li>틀에 박힌 생활을 싫어한다</li>
  <li>고집이 있고 주장이 강하다</li>
  <li>말이 없고 내색을 않는다</li>
  <li>객관적 원리에 관심이 많다</li>
  <li>도구를 다루는데 관심이 있다</li>
  <li>느낌과 감정, 타인에 대한 마음을 표현하기 어려워한다</li>
  <li>정의감이 있으나 직설적인 말로 타인의 감정을 상하게 할 수 있다</li>
  <li>충동에 따라 행동하기 때문에 언제라도 일자리를 박차고 떠날 수 있다</li>
  <li>정밀을 요하는 일을 잘 해낸다</li>
  <li>타인의 일에 무관심한 편이다</li>
  <li>모험과 스릴을 즐긴다</li>
  <li>관심분야가 아니면 처다 보지도 않는다</li>
  <li>생각은 적극적인데 행동은 소극적</li>
  <li>노력을 절약하면서(게으르다는 소리를 들음) 일의 능률을 높인다  </li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>타인에 대해서 의도적으로 관심을 갖는 것이 필요 </li>
  <li>화가 난 얼굴이 창백하게 보일 수 있으므로 얼굴 관리에 신경 쓰는 것이 필요 </li>
  <li>함께 하는 일을 오락시간을 갖는 것이 필요</li>
  </ul>`,
  ISFP:`<h2>성인군자형</h2>
  <h4>"따뜻한 감성을 가진 사람들"</h4>
  말없이 다정하고 온화하며 친절하고 연기력이 뛰어나며 겸손하다 말없이 다정하고, 양털 안감을 놓은 오버코트처럼 속마음이 따뜻하고 친절하다. 그러나 상대방을 잘 알게 될 때까지 이 따뜻함을 잘 드러내지 않는다.  동정적이며 자기 능력에 대해서 모든 성격 유형 중에서 가장 겸손하고 적응력과 관용성이 많다. 자신의 의견이나 가치를 타인에게 강요하지 않으며 반대의견이나 충돌을 피하고, 인화를 중시한다. 인간과 관계되는 일을 할 때 자신과 타인의 감정에 지나치게 민감하고, 결정력과 추진력이 필요할 때가 많을 것이다. 일상활동에 있어서 관용적, 개방적, 융통성, 적응력이 있다. 
  <ul>
  <h4>일반적인 특성</h4>
  <li>삶의 현재를 즐기는 사람이다</li>
  <li>다른 사람의 부탁을 거절하기 어려워한다</li>
  <li>자신을 내세우지 않는다. 자기 자랑이 없다</li>
  <li>마음이 순하고 따뜻하며 정이 많다</li>
  <li>남을 잘 믿고 의심하지 않는다. 사기 당 할 확률이 높다</li>
  <li>누구하고나 어떤 사회에서나 맞추어 가며 살 수 있는 사람</li>
  <li>규칙 틀에 묶이는 것을 싫어한다</li>
  <li>추진력, 결정력이 부족하다</li>
  <li>조용히 있다가 무대에서 끼를 발휘한다. - 몰입이 특징</li>
  <li>결단력이 부족하고 끊고 맺는 맛이 없다</li>
  <li>자연적인 것, 목가적인 것, 전원적인 것을 갈구</li>
  <li>생각은 많고 행동은 부족하다</li>
  <li>지나치게 타인을 배려한다</li>
  <li>대중 앞에 선뜻 나서지 못한다</li>
  <li>싸울 때 감정이 앞서 논리적이지 못하다</li>
  <li>계획성이 없다</li>
  <li>남에게 싫은 소리 못하고 속으로 삭인다</li>
  <li>타인을 무조건 이해해 주고 자기 의견과는 상관없이 따라가 준다</li>
  <li>즐기는 것에 대한 호기심이 많다</li>
  <li>예술적인 기질이 있다. (연극배우, 가수, 피아니스트 등)</li>
  <li>포용력과 이해력이 많다</li>
  <li>경쟁하는 분위기보다는 편안한 분위기에서 능력을 발휘한다</li>
  <li>조직에서 시간이 오래 지나야 인정을 받는다</li>
  <li>딱딱하고 사무적인 사람을 싫어한다 </li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>적극적인 사고와 적극적이 행동이 필요</li>
  <li>자기를 드러내는 연습이 필요</li>
  <li>즐거움에 대한 호기심을 자제하고 우선 순위에 맞춰 일하는 연습이 필요</li>
  </ul>`,
  INFP:`<h2>잔다르크형</h2>
  <h4>"이상적인 세상을 만들어가는 사람들"</h4>
  정열적이고 충실하며 목가적이고, 낭만적이며 내적 신념이 깊다. 마음이 따뜻하고 조용하며 자신이 관계하는 일이나 사람에 대하여 책임감이 강하고 성실하다. 이해심이 많고 관대하며 자신이 지향하는 이상에 대하여 정열적인 신념을 가졌으며, 남을 지배하거나 좋은 인상을 주고자하는 경향이 거의 없다. 완벽주의적 경향이 있으며, 노동의 대가를 넘어서 자신이 하는 일에 흥미를 찾고자하는 경향이 있으며, 인간이해와 인간복지에 기여할 수 있는 일을 하기를 원한다. 언어, 문학, 상담, 심리학, 과학, 예술분야에서 능력을 발휘한다. 자신의 이상과 현실이 안고 있는 실제 상황을 고려하는 능력이 필요하다.
  <h4>일반적인 특성</h4>
  <ul>
  <li>현실감각이 둔하다. - 가계부를 소설로 쓴다.</li>
  <li>몽상가적 기질이 많다.</li>
  <li>인간과 종교(정신세계)에 관심이 많다.</li>
  <li>분위기를 잘 탄다. (분위기가 좋으면 끝까지 남는다)
  <li>아름다움과 추함, 선 과 악, 도덕과 비도덕에 민감하게 반응한다.</li>
  <li>신념이 뚜렷하여 겉으로는 주장을 안해도 속으로는 열정이 있다.</li>
  <li>가치 있는 일에는 생명도 바친다.</li>
  <li>내면의 세계를 추구하여 늘 무엇을 갈구하고 추구해 나간다.</li>
  <li>규칙을 몸서리 치듯 싫어하며 반복되는 일상적인 생활을 싫어한다.</li>
  <li>맡겨진 일에 대해서는 지나치게 완벽주의 적으로 나가는 경향이 있다.</li>
  <li>즉흥적이며 변화가 비슷하다.</li>
  <li>내면의 갈등이 심하여 감정의 기복이 심하다.</li>
  <li>일을 잘 벌이나 마루리가 서툴다.</li>
  <li>여행을 좋아하고, 영화, 음악, 책을 좋아한다.</li>
  <li>계절의 변화에 민감하다.</li>
  <li>상대방의 말에 민감하다.</li>
  <li>어느 부분에 대해서는 융통성이 아주 없는 편이다.</li>
  <li>상대방을 배려해서 빙빙 돌려서 은유적으로 의사 표현한다.</li>
  <li>맘에 맞는 사람 만나면 밤을 새워가며 이야기한다.</li>
  <li>논리적이지 못하고 감정적이다.</li>
  <li>감정 조절이 미성숙하다.</li>
  <li>아이디어가 많으나 실행에 잘 옮기지 못한다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>현실과 이상을 구분하는 능력이 필요.</li>
  <li>대인관계에서 가치관에 맞지 않는 것이라도 융통성을 보일 필요가 있다.</li>
  <li>꾸준함을 기르기 위해서 아주 작은 일부터 통제력을 갖는 것이 필요.</li>
  </ul>`,
  INTP:`<h2>아이디어 뱅크형</h2>
  <h4>"비평적인 관점을 가지고 있는 뛰어난 전략가들"</h4>
  조용하고 과묵하며 논리와 분석으로 문제를 해결하기 좋아한다. 과묵하나 관심이 있는 분야에 대해서는 말을 잘하며 이해가 빠르고 높은 직관력으로 통찰하는 재능과 지적 호기심이 많다. 개인적인 인간관계나 친목회 혹은 잡담 등에 별로 관심이 없으며 매우 분석적이고 논리적이며 객관적비평을 잘 한다. 지적 호기심을 발휘할 수 있는 분야 즉 순수과학, 연구, 수학, 엔지니어링 분야나 추상적 개념을 다루는 경제, 철학, 심리학 분야의 학문을 좋아한다. 지나치게 추상적이고 비현실적이며 사교성이 결여되기 쉬운 경향이 있고, 때로는 자신의 지적 능력을 은근히 과시하는 수가 있기 때문에 거만하게 보일 수 있다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>행동하기 보다 책을 통해서 배운다.(책중독)</li>
  <li>높은 직관력으로 통찰하는 재능과 지적관심이 많다.</li>
  <li>조용하고 말이 없으나 자기의 관심 분야에서는 말을 많이 한다.</li>
  <li>정서표현이 별로 없어 친해지기 전에는 이해하기 어렵다.</li>
  <li>기분이나 감정도 생각을 통해서 한다.</li>
  <li>지나치게 지적이고 추상적이며 설명이 너무 이론적이다.</li>
  <li>황당무게한 공상을 잘 한다.</li>
  <li>비현실적이며 비약이 심하다.</li>
  <li>타인에게 별로 관심이 없다.</li>
  <li>생각은 창의적인데 실천이 부족하다.</li>
  <li>조직이나 단계, 계통 등에 약하다.</li>
  <li>충동적이다.</li>
  <li>매뉴얼 보기 싫어한다.</li>
  <li>정장을 싫어한다.</li>
  <li>패션감각이 둔하다.</li>
  <li>드라마, 한국영화 잘 안 본다.</li>
  <li>뻔한 이야기나 서론이 긴 것 참기 어렵다.</li>
  <li>주관이 뚜렷하고 자신은 합리적이라 생각한다.</li>
  <li>꼭 필요한 것 아니면 잊어버린다.(건망증)</li>
  <li>머릿속에 있다가 막판에 후다닥 일 처리를 한다.</li>
  <li>한끼 떼우면 된다.</li>
  <li>남들 좋아하는 연예인, 악세사리 등에 관심 없다.</li>
  <li>추리소설 좋아한다.</li>
  <li>잡담 모임 후에는 허무감을 느낀다.</li>
  <li>친한 친구라도 일 없으면 연락 안다.</li>
  <li>공상과 상상속에 있을 때가 많다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>타인의 노력을 인정하는 태도 필요.</li>
  <li>팀으로 하는 일에 적극적으로 뛰어들 필요가 있다.</li>
  <li>생각보다 종이에 적어보고 정리해 보는 연습이 필요.</li>
  </ul>`,
  ESTP:`<h2>수완좋은 활동가형</h2>
  <h4>"친구, 운동, 음식등 다양한 활동을 선호하는 사람들"</h4>
  현실적인 문제해결에 능하며 적응력이 강하고 관용적이다. 사실적이고 관대하며, 개방적이고 사람이나 일에 대한 선입관이 별로 없다. 강한 현실감각으로 타협책을 모색하고 문제를 해결하는 능력이 뛰어나다. 적응을 잘하고 친구를 좋아하며 긴 설명을 싫어하고, 운동, 음식, 다양한 활동 등 주로 오관으로 보고, 듣고, 만질 수 있는 생활의 모든 것을 즐기는 형이다. 순발력이 뛰어나며 많은 사실들을 쉽게 기억하고, 예술적인 멋과 판단력을 지니고 있으며, 연장이나 재료들을 다루는데 능숙하다. 논리 분석적으로 일을 처리하고, 추상적인 아이디어나 개념에 대해 별로 흥미가 없다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>정보통이다.</li>
  <li>내기를 좋아한다.</li>
  <li>삶을 즐기며 산다.</li>
  <li>사람이나, 사건에 대해 선입감이 없고 개방적이다.</li>
  <li>스릴을 좋아한다.</li>
  <li>책을 통해서 보다는 직접 경험을 선호한다.</li>
  <li>즉흥적인 행동에 의존.</li>
  <li>일을 마지막에 폭발적으로 한다.</li>
  <li>흥미 위주의 욕구가 많다. (경쟁, 게임).</li>
  <li>묶여 있지 않은 자유로운 상태일 때 일의 능률이 오른다.</li>
  <li>일반 보병보다 특공대 체질.</li>
  <li>현실적인 계산이 눈에 보인다.</li>
  <li>제멋대로 자유분방.</li>
  <li>현 우리나라의 학교 분위기에 적응하기 어려움을 느낀다.</li>
  <li>자신감이 항상 철철 넘친다.</li>
  <li>공부보다는 스포츠와 같은 활동적인 것에 집중력이 있다.</li>
  <li>주위의 사람이나 일어나는 일에 관심이 많다.</li>
  <li>조금 깊게 생각하는 것을 싫어하는 경향이 있다.</li>
  <li>자극적인 것을 좋아한다.</li>
  <li>오늘 할 일을 내일로 미룬다.</li>
  <li>성취욕이 강하다.</li>
  <li>새로운 것에 대한 도전 욕구가 강함.</li>
  <li>타인에게 선입견이 별로 없고 개방적이다.</li>
  <li>일을 한꺼번에 처리한다.</li>
  <li>감정을 있는 그대로 표현하여 상대방이 상처를 받을 수 있다.</li>
  <li>따지고 분석하고 이해가 되야 수긍한다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>직설적인 말보다는 배려하는 말이 필요하다</li>
  <li>정신세계에 대해서 관심을 갖을 필요가 있다</li>
  <li>일을 벌리기 보다는 마무리 짓는데 노력을 기울일 필요가 있다</li>
  </ul>`,
  ESFP:`<h2>사교적인 유형</h2>
  <h4>"분위기를 고조시키는 우호적인 사람들"</h4>
  사교적이고 활동적이며 수용적이고 친절하며 낙천적이다. 현실적이고 실제적이며 친절하다. 어떤 상황이든 잘 적응하며 수용력이 강하고 사교적이다. 주위의 사람이나 일어나는 일에 대하여 관심이 많으며 사람이나 사물을 다루는 사실적인 상식이 풍부하다. 물질적 소유나 운용 등의 실생활을 즐기며, 상식과 실제적 능력을 필요로 하는 분야의 일 즉, 의료, 판매, 교통, 유흥업, 간호직, 비서직, 사무직, 감독직, 기계를 다루는 분야를 선호한다. 때로는 조금 수다스럽고, 깊이가 결여되거나 마무리를 등한시하는 경향이 있으나, 어떤 조직체나 공동체에서 밝고 재미있는 분위기 조성 역할을 잘한다.
  <h4>일반적인 특성</h4>
  <ul>
  <li>타인을 기쁘게 해줄 깜짝쇼를 준비하면서 즐거워한다.</li>
  <li>내 자신의 이야기를 상대방을 가리지 않고 아무에게나 잘 털어놓는다.</li>
  <li>자신에게 너그럽고 다른 대외적인 책임감이 따르는 일은 열성을 가지고 일한다.</li>
  <li>무계획적이고 충동적인 여행을 즐긴다.</li>
  <li>발등에 불이 떨어져야 행동에 옮긴다.</li>
  <li>직설적으로 말하고 흥분을 잘하며 목소리가 크다.</li>
  <li>집에 있으면 무기력한 느낌이 들고 쉬는 날은 거의 외출.</li>
  <li>청소나 빨래를 제시간에 하지 않고 몰아서 꼭 해야 할 때 한다.</li>
  <li>내일은 내일의 태양이 뜬다.</li>
  <li>싫고 좋은 사람이 분명하며 표정에 나타난다.</li>
  <li>정이 많고 건망증이 심하다.</li>
  <li>거절을 잘 못한다.</li>
  <li>잘 먹고, 잘 자고, 생각이 단순하다. 고민하다가 그냥 잠든다.</li>
  <li>혼자 있는 것을 힘들어한다.</li>
  <li>조직생활 보다는 자유로울 때 능력을 발휘한다.</li>
  <li>정작 하고 싶은 말은 못한다.</li>
  <li>기분파, 돈 있으면 일단 쓰고 본다.</li>
  <li>이야기 할 때 요점과 더불어 부연 설명을 많이 덧붙인다.</li>
  <li>귀가 얇다.( 상황에 따라, 주위 사람들의 반응에 따라 잘 변한다.).</li>
  <li>틀에 박힌 것 싫어하고, 계획에 따라 하는 것 힘들어한다 .</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>끊고 맺는 것을 개발 할 필요가 있다.</li>
  <li>계획성 있는 일처리 방식이 필요.</li>
  <li>가끔 혼자서 자기의 내면을 성찰의 시간이 필요.</li>
  </ul>`,
  ENFP:`<h4>스파크형</h4>
  따뜻하고 정열적이고 활기에 넘치며 재능이 많고 상상력이 풍부하다. 온정적이고 창의적이며 항상 새로운 가능성을 찾고 시도한 형이다. 문제 해결에 재빠르고 관심이 있는 일은 무엇이든지 수행해내는 능력과 열성이 있다. 다른 사람들에게 관심을 쏟으며 사람들을 잘 다루고 뛰어난 통찰력으로 도움을 준다. 상담, 교육, 과학, 저널리스트, 광고, 판매, 성직, 작가 등의 분야에서 뛰어난 재능을 보인다. 반복되는 일상적인 일을 참지 못하고 열성이 나지 않는다. 또한 한가지 일을 끝내기도 전에 몇 가지 다른 일을 또 벌리는 경향을 가지고 있다. 통찰력과 창의력이 요구되지 않는 일에는 흥미를 느끼지 못하고 열성을 불러일으키지 못한다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>감정이 얼굴에 잘 들어 난다 </li>
  <li>새로운 시도를 좋아한다 </li>
  <li>계획하기보다는 그때그때 일을 처리하는 편이다 </li>
  <li>새로운 사람 만나기를 좋아한다  </li>
  <li>감동을 잘하고 눈물도 잘 흘린다  </li>
  <li>돈 개념이 희박하다. 돈을 모으기 힘들 수 있다 </li>
  <li>감정의 기복이 심하다 </li>
  <li>경쟁의식이 없다 </li>
  <li>상대방의 말에 민감하나 기분이 나쁘지 않은 척 한다 </li>
  <li>내면에 열정을 지녔다 </li>
  <li>위기 대처능력이 뛰어난다 </li>
  <li>사람을 기쁘게 해주는 타고난 능력이 있다 </li>
  <li>행사나 일을 잘 주선한다 </li>
  <li>놀다가도 몰입이 안되고 지금 무엇하고 있는 건가? 라는 생각이 들 때가 있다 </li>
  <li>멋 내는 것을 좋아한다 </li>
  <li>양보를 잘하고 싸움을 할려면 심장부터 뛴다  </li>
  <li>단순암기에 약하다 </li>
  <li>인생을 즐겁게 살려고 한다  </li>
  <li>선생님이 마음에 들면 하기 싫은 과목도 잘한다 </li>
  <li>하기 싫은 것에 대한 인내력이 부족하다 </li>
  <li>좋아하는 사람과 싫어하는 사람의 구별이 심하다 </li>
  <li>반복적인 일상을 힘들어 한다 </li>
  <li>분위기를 잘 띄운 후에 자기는 빠진다</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>감정의 기복을 이겨내기 위해서 꾸준한 운동이 필요</li>
  <li>좋아하는 일만 하기보다 우선순위에 맞추어서 하는 것이 필요</li>
  <li>상대방의 말에 대해서 객관화 작업이 필요</li>
  <li>규칙적이고 체계적일 필요가 있다</li>
  <li>현실에 충실해야 한다</li>
  <li>인내심을 길러야 한다</li>
  </ul>
  `,
  ENTP:`<h2>발명가형</h2>
  <h4>"풍부한 상상력을 가지고 새로운 것에 도전하는 사람들"</h4>
  민첩하고 독창적이며 안목이 넓으며 다방면에 관심과 재능이 많다. 독창적이며 창의력이 풍부하고 넓은 안목을 갖고 있으며 다방면에 지능이 많다. 풍부한 상상력과 새로운 일을 시도하는 솔선력이 강하며 논리적이다. 새로운 문제나 복잡한 문제에 해결 능력이 뛰어나며 사람들의 동향에 대해 기민하고 박식하다. 그러나 일상적이고 세부적인 일을 경시하고 태만하기 쉽다. 즉, 새로운 도전이 없는 일에는 흥미가 없으나 관심을 갖고 있는 일에는 대단한 수행능력을 가지고 있다. 발명가, 과학자, 문제해결사, 저널리스트, 마케팅, 컴퓨터 분석 등에 탁월한 능력이 있다. 때로 경쟁적이며 현실보다는 이론에 더 밝은 편이다. 
  <h4>일반적인 특성</h4>
  <ul>
  </li>한번들은 얘기를 또 듣는 건 싫어한다</li>
  </li>5대양 6대주가 활동 무대 이건 싫어한다</li>
  </li>여자인 경우 치마를 두른 남자 같다</li>
  </li>복잡한 문제일수록 쉽게 해결한다</li>
  </li>마음만 먹으면 못하는 것이 없다</li>
  </li>전공이 여러 가지이다</li>
  </li>굉장히 다재다능하고 능력이 있다</li>
  </li>단어 하나로 2시간도 이야기 한다</li>
  </li>초, 중, 고등학교 의 규칙생활이 힘들 수 있다</li>
  </li>일상적인 일에 쉽게 싫증을 느낀다</li>
  </li>007 제임스 본드형 이다</li>
  </li>인간관계가 자유롭다</li>
  </li>똑같은 강의를 반복 못한다</li>
  </li>관심분야는 대단히 박식 관심 없는 분야는 대단히 무식</li>
  </li>경쟁심이 많다</li>
  </li>일상적이고 반복되는 일은 지루하고 힘들어 한다</li>
  </li>항상 새로운 것을 추구한다</li>
  </li>빠뜨리거나 빼먹는 일이 많다</li>
  </li>다른 누구의 권유나 참견은 질색이다</li>
  </li>자기의 판단에 따라 행동한다</li>
  </li>끈기 있게 한 가지 일에 몰두하지 못한다</li>
  </li>말을 나오는 대로 막할 수 있다</li>
  </li>처음 보는 사람과도 금방 친해진다</li>
  </li>팔방미인, 눈썰미가 좋다</li>
  </li>길게 설명하는 건 짜증난다 </li>
  </ul>
  <h4>개발해야할점</h4> 
  <ul>
  </li>말을 할 때 저 사람이 어떻게 느낄 까 먼저 생각하는 것이 필요</li>
  </li>일의 끝마무리에 대한 인내심이 필요</li>
  </li>타인에 대한 칭찬, 격려, 인정이 필요</li>
  </ul>`,
  ESTJ:`<h2>사업가형</h2>
  <h4>"사무적, 실용적, 현실적으로 일을 많이 하는 사람들"</h4>
  구체적이고 현실적이고 사실적이며 활동을 조직화하고 주도해 나가는 지도력이 있다. 실질적이고 현실감각이 뛰어나며 일을 조직하고 계획하여 추진시키는 능력이 있다. 기계분야나 행정 분야에 재능을 지녔으며, 체계적으로 사업체나 조직체를 이끌어 나간다. 타고난 지도자로써 일의 목표를 설정하고, 지시하고 결정하고 이행하는 능력이 있다. 결과를 눈으로 볼 수 있는 일, 즉, 사업가, 행정관리, 생산건축 등의 분야에서 능력을 발휘할 수 있다. 속단 속결하는 경향과 지나치게 업무 위주로 사람을 대하는 경향이 있으므로 인간 중심의 가치와 타인의 감정을 충분히 고려해야 한다. 또 미래의 가능성보다 현재의 사실을 추구하기 때문에 현실적, 실용적인 면이 강하다.
  <h4>일반적인 특성</h4>
  <ul>
  <li>감정이 잘 드러나 직설적인 언어로 표현한다.</li>
  <li>솔직하고 화끈하다.</li>
  <li>나서기를 잘한다.</li>
  <li>휴일에 약속이 없으면 불안하다.</li>
  <li>주장이 강하고 나서길 좋아한다.</li>
  <li>논리적, 분석적 객관적이며 분명한 규칙을 중요시하고 그에 따라 행동하고 일을 추진하고 완성한다.</li>
  <li>고집이 있지만 논리적으로 긍정하게 되면 더 이상 고집을 피우지 않는다.</li>
  <li>혼자서 일하기 싫어한다.</li>
  <li>일을 잘해 놓고도 존경받는 일이 드물 수 있다.</li>
  <li>집단에서 분위기 보다는 목적의식을 중요시한다.</li>
  <li>경영자 적인 재질을 지녔다.</li>
  <li>한번 시작한 일을 철저하게 뿌리뽑는다.</li>
  <li>전철을 탈 때도 어느 칸에 타야 갈아타기 편한지 계산하고 탄다.</li>
  <li>예약과 계획의 생활화.</li>
  <li>독창력, 창의력이 부족하다.</li>
  <li>말이 빠르고 걸음이 빠르다.</li>
  <li>화끈하며 뒤끝이 없다.</li>
  <li>지배하려는 성격이 있어도 양보는 잘 하지 않는다.</li>
  <li>감동시키기보다는 이해시키길 원한다.</li>
  <li>외출 시 꼭 메모를 한다.</li>
  <li>가만히 있으면 피곤하다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>지나치게 일 중심적이기 때문에 가족에게 소홀 할 수 있으므로 일 보다 사람 중심적인 생활에 필요.</li>
  <li>급하게 결정하기 전에 여러 상황을 생각할 필요가 있다.</li>
  <li>타인의 정서적인 면에 관심을 가질 필요가 있다.</li>
  </ul>`,
  ESFJ:`<h4>친선도모형</h4>
  구체적이고 현실적이고 사실적이며 활동을 조직화하고 주도해 나가는 지도력이 있다 실질적이고 현실감각이 뛰어나며 일을 조직하고 계획하여 추진시키는 능력이 있다. 기계분야나 행정 분야에 재능을 지녔으며, 체계적으로 사업체나 조직체를 이끌어 나간다. 타고난 지도자로써 일의 목표를 설정하고, 지시하고 결정하고 이행하는 능력이 있다. 결과를 눈으로 볼 수 있는 일, 즉, 사업가, 행정관리, 생산건축 등의 분야에서 능력을 발휘할 수 있다. 속단 속결하는 경향과 지나치게 업무 위주로 사람을 대하는 경향이 있으므로 인간 중심의 가치와 타인의 감정을 충분히 고려해야 한다. 또 미래의 가능성보다 현재의 사실을 추구하기 때문에 현실적, 실용적인 면이 강하다.
  <h4>일반적인 특성</h4>
  <ul>
  <li>신나고 재미있는 사람이다</li>
  <li>스트레스를 받으면 누구를 만나야 한다.</li>
  <li>강의 때 고개를 제일 많이 끄덕이어 강사를 즐겁게 한다.</li>
  <li>준비성이 철저하며, 참을성이 많고 타인을 잘 돕는다.</li>
  <li>남에게 동조하는 경향이 뛰어나며 사람들과의 상호 활동에서 기력이 생긴다.</li>
  <li>타인의 인정을 받는 것에 아주 민감하다.</li>
  <li>보수적이며, 좋은 음식을 좋아하고, 봉사를 좋아하며 재물을 모으는 것을 즐김.</li>
  <li>자신이 존경하는 사람이나 물건을 이상화하는 경향이 있다.</li>
  <li>제품을 보고 사는 것이 아니라 ESFJ의 인간적인 면에 반해서 산다.</li>
  <li>생각은 창의적인데 실천이 부족하다.</li>
  <li>타인을 돕고 싶은 욕구 때문에 자신의 업무를 소홀히 할 수 있다.</li>
  <li>잔걱정이 많다.</li>
  <li>가족들에게 잔소리가 심하다.</li>
  <li>집단의 일이나 목적을 개인의 것보다 앞세운다.</li>
  <li>조화와 균형을 중요시한다.</li>
  <li>싫은 소리하기 싫어한다.</li>
  <li>사람들 사이에서 중재자 역할을 잘한다.</li>
  <li>자녀와 정서적인 독립이 안되어 걱정이 끊이지가 않는다.</li>
  <li>별명이 수도꼭지 - 눈물이 많다.</li>
  <li>친절하고 재치 있다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>가족들과 독립이 필요하다.</li>
  <li>타인의 일에 때로는 냉정하게 생각해 볼 여유가 필요하다.</li>
  <li>잔걱정을 줄이기 위해서 걱정을 객관화 시켜 볼 필요가 있다.</li>
  </ul>`,
  ENFJ:`<h2>언변능숙형</h2>
  <h4>"타인의 성장을 도모하고 협동하는 사람들"</h4>
  따뜻하고 적극적이며 책임감이 강하고 사교성이 풍부하고 동정심이 많다. 민첩하고 동정심이 많고 사교적이며 인화를 중요시하고 참을성이 많다. 다른 사람들의 생각이나 의견에 진지한 관심을 가지고 공동선을 위하여 다른 사람의 의견에 대체로 동의한다. 현재보다는 미래의 가능성을 추구하며 편안하고 능란하게 계획을 제시하고 집단을 이끌어 가는 능력이 있다. 사람을 다루는 교직, 성직, 심리 상담치료, 예술, 문학, 외교, 판매에 적합하다. 때로 다른 사람들의 좋은 점을 지나치게 이상화하고 맹목적 충성을 보이는 경향이 있으며 다른 사람들에 대해서도 자기와 같을 것이라고 생각하는 경향이 있다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>마음이 약하고 남의 의견에 동화를 잘하는 편이다.</li>
  <li>말로 표현을 잘하고 생각이나 마음을 잘 연다.</li>
  <li>적극적이고 추진력이 강한 편이다.</li>
  <li>좀 어렵게 생각되는 일도 되는 쪽으로 몰고간다.</li>
  <li>일의 결과보다는 사람과의 인화를 더 중요시하는 편이다.</li>
  <li>사전 계획을 세우고 그에 따라 행하고자 한다.</li>
  <li>화가나면 겉으로 표현하지 않고 묵묵히 참아낸다.</li>
  <li>타인에게 무척 사교적이지만 집에 있는 아이들에게는 안 그럴 수 있다.</li>
  <li>상처를 받으면 오랜시간 가슴아파한다.</li>
  <li>현실보다는 더 나은 삶 이상을 추구한다.</li>
  <li>맺고 끊는 것이 분명하지 못함.</li>
  <li>정, 눈물, 동정심이 많음.</li>
  <li>상대방의 말에 민감하다.</li>
  <li>사람을 섬기기 위해서 세상에 나왔음 .</li>
  <li>사람을 좋아하고 비판적인 시각보다는 긍정적으로 보려는 시각이 강함.</li>
  <li>사람에 대해 맹목적 이상화 경향이 있다.</li>
  <li>타인에게 인정과 칭찬을 받는 일에만 열중할 수 있다.</li>
  <li>사람을 위해 봉사하는 분야에 능력이 있다.</li>
  <li>사람과 사람을 잘 엮는다.</li>
  <li>감정의 기복이 심하다.</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>현실적인 일과 세부 사항에 대한 관심이 필요.</li>
  <li>인간관계를 중요하다가 큰 일을 소홀히 할 수 있다.</li>
  <li>타인의 말에 대해서 객관적인 작업이 필요.</li>
  </ul>`,
  ENTJ:`<h2>지도자형</h2>
  <h4>"비젼을 가지고 사람들을 활력적으로 이끌어가는사람들"</h4>
  열성이 많고 솔직하고 단호하고 지도력과 통솔력이 있다. 활동적이고 솔직하며, 결정력과 통솔력이 있고, 장기적 계획과 거시적 안목을 선호한다. 지식에 대한 욕구와 관심이 많으며 특히 지적인 자극을 주는 새로운 아이디어에 높은 관심을 가졌다. 일 처리에 있어 사전준비를 철저히 하며 논리 분석적으로 계획하고 조직하여 체계적으로 추진해 나가는 형이다. 다른 사람의 의견에 귀를 기울일 필요가 있으며, 자신과 타인의 감정에 충실할 필요가 있다. 자신의 느낌이나 감정을 인정하고 표현함이 중요하며, 성급한 판단이나 결론을 피해야 한다. 그렇지 않으면 누적된 감정이 크게 폭발할 가능성도 있다. 
  <h4>일반적인 특성</h4>
  <ul>
  <li>타고난 지도자형.</li>
  <li>조직적, 체계적, 계획적이다.</li>
  <li>일은 일대로 하고 욕은 욕대로 먹을 수 있다.</li>
  <li>너무 완벽을 추구하기 때문에 남이 비집고 들어갈 틈이 없다.</li>
  <li>상상을 많이 한다.</li>
  <li>혼자 있는 것을 싫어한다.</li>
  <li>동물을 별로 좋아하지 않는다.</li>
  <li>고집이 세고, 호기심이 많다.</li>
  <li>지적 욕구가 강하다.</li>
  <li>감정표현이 솔직해서 타인이 상처를 받을 수 있다.</li>
  <li>사람보다 일을 중시한다.</li>
  <li>항상 계획을 하고 실행한다.</li>
  <li>일상적인 반복되는 일을 싫어한다.</li>
  <li>가끔 엉뚱할 때가 있다.</li>
  <li>변화 있는 생활을 즐긴다.</li>
  <li>어려운 일을 만나도 자극이 되어 쉽게 처리한다.</li>
  <li>지적 능력 향상에 노력하고자 한다.</li>
  <li>권위적이지 않다.</li>
  <li>미래에 대한 꿈이 크다.</li>
  <li>솔직하고 결단력, 통솔력이 있으며 거시적 안목으로 일을 추진해 나감 .</li>
  </ul>
  <h4>개발해야할점</h4>
  <ul>
  <li>속단 속결하여 배려하기보다는 강압적으로 하기 쉬우므로 직설적인 말을 삼가야 할 필요가 있다 .</li>
  <li>타인의 말을 적극적으로 경청할 필요가 있다 .</li>
  <li>일 중심 보다 사람중심의 생활이 필요.</li>
  </ul>`,
};